# Homebrew Bundle — managed by chezmoi, applied via `brew bundle`.
# Replaces the old arkade + run_install_executables.sh imperative installers.

# Third-party taps
tap "openclaw/tap"   # gogcli — Google Workspace CLI

# AWS
brew "awscli"        # v2 (v1 is EOL)

# Cloud / Kubernetes CLIs (formerly installed via arkade)
brew "kubectl"
brew "kustomize"
brew "helm"
brew "istioctl"
brew "argocd"
brew "krew"          # kubectl plugin manager (different layer — kept)
brew "opentofu"      # open-source terraform successor

# Modern CLI tooling (Phase 4)
brew "mise"        # polyglot version manager (replaces pyenv/gradle/node hacks)
brew "starship"    # prompt (replaces spaceship + oh-my-zsh theme)
brew "zoxide"      # smarter cd (replaces fasd)
brew "uv"          # python env/package manager (replaces pyenv+virtualenvwrapper)
brew "ripgrep"     # rg (replaces ack)
brew "fd"
brew "eza"
brew "bat"
brew "fzf"
brew "git-delta"   # git diff pager
brew "lazygit"     # git TUI (LazyVim integration)
brew "glow"        # Render markdown on the CLI, with pizzazz!
brew "openclaw/tap/gogcli"  # gog: CLI for Google Workspace (Gmail/Drive/Docs/Sheets/...)

# Shell / terminal
brew "tmux"        # referenced by the oh-my-zsh tmux plugin

# GUI apps (casks)
cask "hammerspoon"     # macOS automation / window management
cask "kitty"           # GPU-accelerated terminal (config in ~/.config/kitty)
cask "docker-desktop"  # licensed; bundles docker/compose/buildx CLIs
cask "obsidian"    # markdown notes / knowledge base
cask "numi"        # calculator / unit converter

# NOTE: casks whose .pkg installer needs an interactive sudo password live in
# ~/.Brewfile-interactive (e.g. google-drive) so this file stays unattended-safe.
# Install them manually: brew bundle --file="$HOME/.Brewfile-interactive"
